In [5]:
import numpy as np
import pandas as pd

from pandas import DataFrame, Series

In [3]:
ser1 = Series(np.arange(4), index=['A','B','C','D'])

ser1 = 2*ser1

ser1

A    0
B    2
C    4
D    6
dtype: int32

In [5]:
ser1['B']

2

In [6]:
ser1[3]

6

In [7]:
ser1[0:4]

A    0
B    2
C    4
D    6
dtype: int32

In [8]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [9]:
ser1[ser1>2]

C    4
D    6
dtype: int32

In [10]:
ser1[ser1>3] = 10

In [11]:
ser1

A     0
B     2
C    10
D    10
dtype: int32

In [6]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['London','Doncaster','Rotherham','Lahore','Brighton'],columns=['A','B','C','D','E'])

dframe

            A   B   C   D   E
London      0   1   2   3   4
Doncaster   5   6   7   8   9
Rotherham  10  11  12  13  14
Lahore     15  16  17  18  19
Brighton   20  21  22  23  24

In [7]:
dframe['B']

London        1
Doncaster     6
Rotherham    11
Lahore       16
Brighton     21
Name: B, dtype: int32

In [8]:
dframe[['B','E']]

            B   E
London      1   4
Doncaster   6   9
Rotherham  11  14
Lahore     16  19
Brighton   21  24

In [9]:
dframe[dframe['C']>8]

            A   B   C   D   E
Rotherham  10  11  12  13  14
Lahore     15  16  17  18  19
Brighton   20  21  22  23  24

In [10]:
dframe > 10

               A      B      C      D      E
London     False  False  False  False  False
Doncaster  False  False  False  False  False
Rotherham  False   True   True   True   True
Lahore      True   True   True   True   True
Brighton    True   True   True   True   True

In [12]:
dframe.loc['Lahore']

A    15
B    16
C    17
D    18
E    19
Name: Lahore, dtype: int32